Public Attributes | List of all members
API_RailingRailEndType Struct Reference
Element Manager API
Represents a Rail/Handrail/Toprail End element. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
API_Guid  | owner
GUID of the Railing Node element owning this Rail End.
API_Guid  | symbID
The identifier of the symbol of this element.
API_RailEndTypeID  | type
The type of the Rail End: |APIRE_Extension|The type is extension.| |APIRE_Curve|The type is curved.| |APIRE_FullReturn|The type is full return.| |APIRE_ConnectWithDuplicate|The type is connection between duplicated handrails.|.
API_RailEndBaseConnectionID  | baseConnection
Connection type between the Rail End and a base: |APIBC_Horizontal|Connection type is horizontal.| |APIBC_Tangential|Connection type is tangential.|.
double  | firstExtrusionOffset
Offset of the first extrusion.
double  | firstExtrusionLength
Length of the first extrusion.
double  | filletRadius
Radius of the filleting of the Rail End.
API_RailEndFixtureConnectionID  | fixtureConnection
The type of the curving in case of Curved type: |APIRC_SegmentPlane|The curving is in the plane of the segment.| |APIRC_HorizontalRight|The curving is horizontal to the right.| |APIRC_HorizontalLeft|The curving is horizontal to the left.|.
API_RailEndArcAngleModeID  | arcAngleMode
Angle mode of the Rail End's arc: |APIAM_SetToVertical|The angle is absolute vertical.| |APIAM_CustomAngle|The angle is relative to the first extrusion.|.
double  | arcAngle
Angle of the Rail End's arc.
double  | arcRadius
Radius of the Rail End's arc.
double  | secondExtrusionLength
Length of the second extrusion.
double  | thirdExtrusionLength
Length of the third extrusion.
API_RailEndExtrusionModeID  | secondExtrusionMode
Mode of the second extrusion: |APIEM_CustomLength|The length is custom.| |APIEM_ToReferenceLine|The length of the extrusion will be set so that it will reach the reference line.| |APIEM_ToHandrailSibling|In case of a handrail the length will be set so that it will reach the other handrail. If this is set for one of the handrails, then the other handrail's secondExtrusionMode will be automatically set to APIEM_ToHandrailSibling, too.|.
API_RailingFinishType  | finishDef
Default finish for the Rail End.
Detailed Description
Represents a Rail/Handrail/Toprail End element.
Member Data Documentation
◆ arcAngle
 API_RailingRailEndType::arcAngle
Angle of the Rail End's arc.
◆ arcAngleMode
 API_RailingRailEndType::arcAngleMode
Angle mode of the Rail End's arc: |APIAM_SetToVertical|The angle is absolute vertical.| |APIAM_CustomAngle|The angle is relative to the first extrusion.|.
◆ arcRadius
 API_RailingRailEndType::arcRadius
Radius of the Rail End's arc.
◆ baseConnection
 API_RailingRailEndType::baseConnection
Connection type between the Rail End and a base: |APIBC_Horizontal|Connection type is horizontal.| |APIBC_Tangential|Connection type is tangential.|.
◆ filletRadius
 API_RailingRailEndType::filletRadius
Radius of the filleting of the Rail End.
◆ finishDef
 API_RailingRailEndType::finishDef
Default finish for the Rail End.
◆ firstExtrusionLength
 API_RailingRailEndType::firstExtrusionLength
Length of the first extrusion.
◆ firstExtrusionOffset
 API_RailingRailEndType::firstExtrusionOffset
Offset of the first extrusion.
◆ fixtureConnection
 API_RailingRailEndType::fixtureConnection
The type of the curving in case of Curved type: |APIRC_SegmentPlane|The curving is in the plane of the segment.| |APIRC_HorizontalRight|The curving is horizontal to the right.| |APIRC_HorizontalLeft|The curving is horizontal to the left.|.
◆ head
 API_RailingRailEndType::head
General element header.
◆ owner
 API_RailingRailEndType::owner
GUID of the Railing Node element owning this Rail End.
◆ secondExtrusionLength
 API_RailingRailEndType::secondExtrusionLength
Length of the second extrusion.
◆ secondExtrusionMode
 API_RailingRailEndType::secondExtrusionMode
Mode of the second extrusion: |APIEM_CustomLength|The length is custom.| |APIEM_ToReferenceLine|The length of the extrusion will be set so that it will reach the reference line.| |APIEM_ToHandrailSibling|In case of a handrail the length will be set so that it will reach the other handrail. If this is set for one of the handrails, then the other handrail's secondExtrusionMode will be automatically set to APIEM_ToHandrailSibling, too.|.
◆ symbID
 API_RailingRailEndType::symbID
The identifier of the symbol of this element.
◆ thirdExtrusionLength
 API_RailingRailEndType::thirdExtrusionLength
Length of the third extrusion.
◆ type
 API_RailingRailEndType::type
The type of the Rail End: |APIRE_Extension|The type is extension.| |APIRE_Curve|The type is curved.| |APIRE_FullReturn|The type is full return.| |APIRE_ConnectWithDuplicate|The type is connection between duplicated handrails.|.